app/controllers/api/v1/items_controller.rb

SELECT "items".* FROM "items"
---
    def index
        respond_with Item.all

INSERT INTO "items" ("name", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", ""], ["description", ""], ["created_at", "2018-08-12 17:36:02.223143"], ["updated_at", "2018-08-12 17:36:02.223143"]]
---
    def create
        respond_with :api, :v1, Item.create(item_params)

DELETE FROM "items" WHERE "items"."id" = ?  [["id", 1]]
---
    def destroy
        respond_with Item.destroy(params[:id])

SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 20], ["LIMIT", 1]]
UPDATE "items" SET "description" = ?, "updated_at" = ? WHERE "items"."id" = ?  [["description", "This is not that shit"], ["updated_at", "2018-08-13 17:42:41.542042"], ["id", 46]]
---
    def update
        item = Item.find(params["id"])
        item.update_attributes(item_params)